'use client';

import React from 'react';
import s from './PoliticsKonf.module.scss';
import 'slick-carousel/slick/slick.css';
import 'slick-carousel/slick/slick-theme.css';

export const PoliticsKonf = () => {
  
  return (
    <>
      <section className={s.section_PoliticsKonf}>
        <div className={`${s.PoliticsKonf_container} ${s.container}`}>
          <h2 className={s.PoliticsKonf__head}>
Политика конфиденциальности
          </h2>
          <div className={s.PoliticsKonf__desc}>
            <div className={s.PoliticsKonf__desc_wrap}>
              <div className={s.wrap__box}>
                <div className={s.wrap__box_about}>
                  <p className={s.box_about_desc}>
                  1. Введение

Настоящая Политика конфиденциальности (далее - &quot;Политика&quot;) описывает, как мы, RealPartners (далее - &quot;Мы&quot;, &quot;Наша компания&quot;), собираем, используем и защищаем ваши личные данные, которые вы предоставляете нам в процессе использования наших услуг и взаимодействия с нашим веб-сайтом.
<br/>
<br/>
2. Сбор и использование личных данных

В процессе предоставления услуг в сфере недвижимости и обработки ваших запросов, мы можем собирать следующие личные данные: 

Имя;
Телефонный номер;
Адрес электронной почты;
Комментарии и дополнительная информация, предоставленная вами добровольно.
Мы используем ваши личные данные для следующих целей:

Оказание услуг и поддержки в сфере недвижимости;
Обработка ваших запросов и обратной связи;
Уведомление о новых предложениях, акциях и услугах, которые могут вас заинтересовать (при наличии вашего согласия);
Соблюдение законных требований и обязательств перед вами.
<br/>
<br/>
3. Защита ваших данных

Мы прилагаем максимальные усилия для защиты ваших личных данных от несанкционированного доступа, использования, изменения или раскрытия. Мы применяем современные методы безопасности для обеспечения сохранности ваших данных.
<br/>
<br/>
4. Сроки хранения данных

Мы храним ваши личные данные только на протяжении необходимого периода для достижения целей, указанных в настоящей Политике, и соблюдения законодательных требований. По истечении срока хранения данные удаляются или анонимизируются.
<br/>
<br/>
5. Передача данных третьим лицам

Мы можем предоставлять ваши личные данные третьим лицам только в случаях, когда это необходимо для выполнения наших обязательств перед вами или в соответствии с законодательными требованиями. Ваша конфиденциальность всегда остается нашим приоритетом.
<br/>
<br/>
6. Ваши права

В соответствии с применимым законодательством о защите данных, у вас есть следующие права:

Право на доступ к своим личным данным;
Право на исправление неверных или устаревших личных данных;
Право на удаление ваших личных данных (при условии соблюдения законных требований);
Право на ограничение обработки ваших личных данных;
Право на переносимость ваших личных данных;
Право на возражение против обработки ваших личных данных;
Право на отзыв согласия на обработку данных (если применимо).
<br/>
<br/>
7. Согласие на обработку данных

Используя наши услуги и взаимодействуя с нашим веб-сайтом, вы соглашаетесь с условиями настоящей Политики конфиденциальности и предоставляете нам согласие на сбор, хранение и использование ваших личных данных в соответствии с ней.
<br/>
<br/>
8. Контакты

Если у вас возникли вопросы или запросы относительно нашей Политики конфиденциальности, пожалуйста, свяжитесь с нами по следующим контактам:

RealPartners
<br/>
<b>Адрес:</b> Дубининская, 90
<br/>
<b>Телефон:</b> +7 995 990 15 14
<br/>
<b>Электронная почта:</b> realpartnerstvo@mail.ru
<br/>
<br/>
9. Изменения в Политике конфиденциальности

Мы можем периодически обновлять настоящую Политику конфиденциальности, чтобы отразить изменения в наших практиках обработки данных. Любые изменения будут опубликованы на нашем веб-сайте. Рекомендуем вам регулярно проверять обновления.
                  </p>
                </div>
              </div>
            </div>
          </div>
        </div>
      </section>
    </>
  );
};

export default PoliticsKonf;